"App Management" = "App Management";

"WIFI Share" = "WiFi File Transfer";

"BT Download Only in Wi-Fi" = "BT Download Only in Wi-Fi";

"BT Bandwidth & Connection" = "BT Bandwidth & Connection";

"Maximum Connections" = "Maximum Connections";

"Connections Per Torrent" = "Connections Per Torrent";

"Enable Limit" = "Enable Limit";

"Upload Limit" = "Upload Limit";

"Download Limit" = "Download Limit";


"Automatically Install" = "Automatically Install";

"Delete After Install" = "Delete After Install";

"Remove Metadata"="Remove Metadata";

"Keep Awake"="Keep Awake";

"This will keep your screen always ON while using AppCake"="This will keep your screen always ON while using AppCake";

"Remove Metadata will stop App Store from updating the app"="Remove Metadata will stop App Store from updating the app";

"Enable iTunes Sync to make apps installed by AppCake can be transfered to your computer by iTunes."="Enable iTunes Sync to allow apps installed by AppCake to be transferred to your computer.";

"iTunes Sync"="iTunes Sync";

"Feedback"="Feedback";

"Changelog"="Changelog";

"I Can Translate"="I Can Translate";

"Clear Image Cache"="Clear Image Cache";

"Settings" = "Settings";

"Show iPhone Apps" = "Show iPhone Apps";